The  FilterCategoryRule  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  FilterRule  .)
 See Also
  FilterCategoryRule Class
  Autodesk.Revit.DB Namespace